data/Parm_PH_29/alpha_15/alpha_15_13929_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0598279108762468 1.00078221064649 0)
(0.179515718451235 0.999816059516281 5.93354326045545e-18)
(0.299121746757359 0.993856736699153 -5.68629588869949e-18)
(0.417747030829745 0.97771619871995 0)
(0.53369752715548 0.948177720694615 -1.85795520733237e-18)
(0.645690865629185 0.906086345919577 2.3385472208768e-17)
(0.754033380436003 0.85538630766965 -1.23845198611831e-17)
(0.859788684502538 0.799563518546192 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0598314189324665 1 0)
(0.179479534051771 0.999032710501484 0)
(0.298901383254898 0.99308080818452 0)
(0.417257892774664 0.97698535390977 0)
(0.532928643326787 0.947546643507698 0)
(0.644770985661909 0.905520761903866 0)
(0.753073120968577 0.854803707218437 0)
(0.85884583063665 0.798894113055979 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0580375 2.024 0)
(0.1741125 2.024 0)
(0.2901875 2.024 0)
(0.4062625 2.024 0)
(0.5223375 2.024 0)
(0.6384125 2.024 0)
(0.7544875 2.024 0)
(0.8705625 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
