data/Parm_PH_29/alpha_15/alpha_15_13929_2024/0/U_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
15600
(
(0.09130454 -0.00044458 0.00000000)
(0.09829896 -0.00070142 0.00000000)
(0.00661533 0.00011953 0.00000000)
(0.00009088 -0.00027037 0.00000000)
(-0.00045605 -0.00038283 0.00000000)
(-0.00574969 0.00133236 0.00000000)
(-0.00687383 0.00426102 0.00000000)
(-0.00776994 0.00450756 0.00000000)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
