data/Parm_PH_29/alpha_15/alpha_15_13929_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00584225 -0.00004562 0.00000000 0.00000736 0.00000000 0.00209477)
(0.00565837 -0.00001761 0.00000000 -0.00000107 0.00000000 0.00210430)
(0.00039128 0.00000930 0.00000000 -0.00000503 0.00000000 0.00008193)
(0.00044036 0.00001722 0.00000000 -0.00001143 0.00000000 0.00077450)
(0.00027379 0.00008218 0.00000000 -0.00009475 0.00000000 -0.00011929)
(0.00190491 -0.00022254 0.00000000 0.00005252 0.00000000 0.00296296)
(0.00107095 -0.00090547 0.00000000 0.00065040 0.00000000 0.00471628)
(0.00087358 -0.00048938 0.00000000 0.00031663 0.00000000 0.00393112)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
